UTAF_Base/requestFiles/BPS_Location_Create.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.location.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <urn:endUserId>id000000</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
	<urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCreate version="1.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         
         <urn1:pseudoName>${Req_pseudoName}</urn1:pseudoName>
         
         <urn1:relatedPartyId>${Req_relatedPartyId}</urn1:relatedPartyId>
         <urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>
         <urn1:cityCode>${Req_cityCode}</urn1:cityCode>
         <urn1:streetCode>${Req_streetCode}</urn1:streetCode>
         <urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>
         
         <urn1:industrialZone>${Req_industrialZone}</urn1:industrialZone>
         
         <urn1:alphaHouseNbr>${Req_alphaHouseNbr}</urn1:alphaHouseNbr>
         
         <urn1:residenceName>${Req_residenceName}</urn1:residenceName>
         
         <urn1:apartmentNbr>${Req_apartmentNbr}</urn1:apartmentNbr>
         
         <urn1:blockNbr>${Req_blockNbr}</urn1:blockNbr>
         
         <urn1:floorNbr>${Req_floorNbr}</urn1:floorNbr>
         
         <urn1:boxNbr>${Req_boxNbr}</urn1:boxNbr>
         
         <urn1:xCoordinate>${Req_xCoordinate}</urn1:xCoordinate>
         
         <urn1:yCoordinate>${Req_yCoordinate}</urn1:yCoordinate>
         
         <urn1:zCoordinate>${Req_zCoordinate}</urn1:zCoordinate>
         
         <urn1:locationRatingCode>${Req_locationRatingCode}</urn1:locationRatingCode>
         
         <urn1:note>${Req_note}</urn1:note>
         
         <urn1:topSecretInd>${Req_topSecretInd}</urn1:topSecretInd>
      </urn1:RequestDataCreate>
   </soapenv:Body>
</soapenv:Envelope>
